/*****************************************Copyright(C)******************************************
****************************************************************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: GPRSMain.h
* Author			: 
* Date First Issued	:
* Version			: 
* Description		:                    
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* //2010		    : V
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
/* Includes-----------------------------------------------------------------------------------*/

#ifndef   __FRAME66_H_
#define   __FRAME66_H_
#include "stdint.h"
#include "common.h"
#include "4GMain.h"
/* Private define-----------------------------------------------------------------------------*/
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/

/*****************************************************************************
* Function     : JM_SendFrameDispose
* Description  : 66接收帧处理
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2018年7月27日
*****************************************************************************/
uint8_t   JM_SendFrameDispose(void);

/**
 * @brief app_get66_qr
 * @param[in] 获取66二维码
 * @param[out]  
 * @return uiret 转化后的数据
 * @note
 */
uint8_t app_get66_qr(uint8_t * pdata,uint8_t len);

/*****************************************************************************
* Function     : _66_SetQRAck
* Description  : 设置二维码应答
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2021年1月12日
*****************************************************************************/
uint8_t   _66_SetQRAck(_GUN_NUM gun);

/*****************************************************************************
* Function     : _66_PreBill
* Description  : 保存订单
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2021年1月12日
*****************************************************************************/
uint8_t   _66_SendBillData(uint8_t * pdata,uint8_t len);

/*****************************************************************************
* Function     : _66_RecvFrameDispose
* Description  : 接收函数处理
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2022年10月26日
*****************************************************************************/
uint8_t   _66_RecvFrameDispose(uint8_t * pdata,uint16_t len);

/*****************************************************************************
* Function     : _66_GetBatchNum
* Description  : 获取交易流水号
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2018年7月27日
******************************************************************************/
uint8_t *  _66_GetBatchNum(uint8_t gun);

/*****************************************************************************
* Function     : _66_PreBill
* Description  : 保存订单
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2021年1月12日
*****************************************************************************/
uint8_t   _66_PreBill(_GUN_NUM gun,uint8_t *pdata);


/*****************************************************************************
* Function     : _66_SetTimeAck
* Description  : 设置时间应答
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2021年1月12日
*****************************************************************************/
uint8_t   _66_SetTimeAck(void);

/*****************************************************************************
* Function     : _66_SendBill
* Description  : 发送订单
* Input        :
* Output       :
* Return       :
* Note(s)      :
* Contributor  : 2022年10月25日
*****************************************************************************/
uint8_t  _66_SendBill(_GUN_NUM gun);

/*****************************************************************************
* Function     : _66_SendStartAck
* Description  : 启动应答
* Input        :
* Output       :
* Return       :
* Note(s)      :
* Contributor  : 2021年3月19日
*****************************************************************************/
uint8_t   _66_SendStartAck(_GUN_NUM gun);

/*****************************************************************************
* Function     : _66_SendStopAck
* Description  : 停止充电应答
* Input        :
* Output       :
* Return       :
* Note(s)      :
* Contributor  : 2021年3月19日
*****************************************************************************/
uint8_t   _66_SendStopAck(_GUN_NUM gun);

/*****************************************************************************
* Function     : APP_Get66StartType
* Description  :获取启动方式
* Input        :
* Output       :
* Return       :
* Note(s)      :
* Contributor  : 2021年3月19日
*****************************************************************************/
uint8_t   APP_Get66StartType(uint8_t gun);

/*****************************************************************************
* Function     : APP_SetAPStartType
* Description  : 设置安培快充启动方式
* Input        :
* Output       :
* Return       :
* Note(s)      :
* Contributor  : 2021年3月19日
*****************************************************************************/
uint8_t   APP_Set66StartType(uint8_t gun ,_4G_START_TYPE  type);

/*****************************************************************************
* Function     : _66_SendDataGunACmd
* Description  : 状态发生变化发送
* Input        : void *pdata
* Output       : None
* Return       :
* Note(s)      :
* Contributor  : 2022年10月25日   完成
*****************************************************************************/
uint8_t    _66_SendDataGunACmd(void);
#endif
/************************(C)COPYRIGHT *****END OF FILE****************************/

